[Ability_fire_boss_dragon.A_boost_oeuf_Buff H7BaseBuff]
mName="龙之力"
mTooltip="根据战场上的龙蛋数量，增加此生物的属性%stat1。"

[Ability_fire_boss_dragon.A_FireBreath H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火焰吐息"
mTooltip="该生物向敌方单位喷射锥形火焰魔法。空方格将被点燃，直到下一个战斗回合结束。站在燃烧方格上或在其回合开始时位于其上的生物会受到伤害。"

[Ability_fire_boss_dragon.A_FireBreath_Buff H7BaseBuff]
mName="火焰吐息"
mTooltip=""

[Ability_fire_boss_dragon.A_RangedAttack_Fire_Projectile H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="爆炸"
mTooltip="此生物的远程攻击命中一个4x4区域。"

[Ability_fire_boss_dragon.A_SolderingHands_oeuf H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="龙之力"
mTooltip="只要此生物在战场上，它就会增加远古火龙的威力和属性。"

[Ability_ice_boss_dragon.A_IcePrison_Attack H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="远古寒冰冲击"
mTooltip="此生物的远程攻击有%buff.chance%的几率冻结目标生物。被冻结的生物无法行动，并在%buff.buff.durini回合内被视为不存在。"

[Ability_ice_boss_dragon.A_IcePrison_Attack2 H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="远古寒冰冲击"
mTooltip="此生物的远程攻击有%buff.chance%的几率冻结目标生物。被冻结的生物无法行动，并在%buff.buff.durini回合内被视为不存在。"

[Ability_ice_boss_dragon.A_link_obstacle_Buff H7BaseBuff]
mName="刺骨寒风"
mTooltip="冻结相邻的敌人%durnow回合。"

[Ability_ice_boss_dragon.A_Mal_du_froid H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="寒冷病"
mTooltip="此生物在战斗回合结束时攻击所有受%spell1.name影响的对手。"

[Ability_ice_boss_dragon.A_MeleeAttack H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="近战攻击"
mTooltip="激活以执行标准攻击。"

[Ability_ice_boss_dragon.A_Zone_obstacle H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="刺骨寒风"
mTooltip="冻结相邻的敌人%buff1.buff.durini回合。"

[Creature_fire_boss_dragon.A_Creature_fire_dragon_Boss H7Creature]
mName="远古火龙"
mLore=""

[Creature_fire_boss_dragon.A_Creature_Oeuf_dragon H7Creature]
mName="龙蛋"
mLore=""

[Creature_ice_boss_dragon.A_Creature_ice_dragon_Boss H7Creature]
mName="远古冰龙"
mLore=""